import re

glass = ['а','у','о','ы','и','э','я','ю','ё','е']
soglas = ['б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ']
result = []
test = ['Аннотация','металл','процессор','стюардесса','гуннский','винница','дискуссия''иммигрант','марокканец']
p = re.compile(r'[аоиеёэыуюя]{1}[бвгджзйклмнпрстфхцчшщ]{2}[а-я]+',re.IGNORECASE)
for w in test:
    res = p.match(w)
    if res != None:
        result.append(res.group())
    else:
        pass
    
print(''.join(result))